html/docker/kubernates-handbook/theory/security/rbac.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>基于角色的访问控制</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="service_account.html"> UP </a>
 |
 <a accesskey="H" href="security.html"> HOME </a>
</div><div id="content">
<h1 class="title">基于角色的访问控制</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf128f5b">API</a>
<ul>
<li><a href="#orgb6933c8">Role 与 ClusterRole</a></li>
<li><a href="#org1985e13">RoleBinding 与 ClusterRoleBinding</a></li>
<li><a href="#org6e34f3d">对资源的引用</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
基于角色的访问控制（ <span class="underline">Role-Based Access Control</span> ）使用 <span class="underline">rbac.authorization.k8s.io</span> API Group 实现 <b>授权</b> 决策，允许管理员通过 Kubernetes API 动态配置策略
</p>

<pre class="example">
  要启用 RBAC，请使用 --authorization-mode=RBAC 启动 API Server
</pre>
<div id="outline-container-orgf128f5b" class="outline-2">
<h2 id="orgf128f5b">API</h2>
<div class="outline-text-2" id="text-orgf128f5b">
<p>
接下来将介绍 RBAC API 所定义的四种顶级类型
</p>

<pre class="example">
    用户可以像使用其他 Kubernetes API 资源一样 （例如通过 kubectl、API 调用等）与这些资源进行交互

    例如，命令 kubectl create -f (resource).yml 可以被用于以下所有的例子
</pre>
</div>
<div id="outline-container-orgb6933c8" class="outline-3">
<h3 id="orgb6933c8">Role 与 ClusterRole</h3>
<div class="outline-text-3" id="text-orgb6933c8">
<p>
在 RBAC API 中，一个 <span class="underline">角色</span> 包含了一套表示 <span class="underline">一组权限</span> 的规则：
</p>
<ul class="org-ul">
<li>权限以纯粹的 <b>累加</b> 形式累积（没有” 否定” 的规则）
<ul class="org-ul">
<li>角色可以由 <span class="underline">namespace</span> 内的 <b>Role</b> 对象定义</li>
<li>整个 <span class="underline">Kubernetes 集群</span> 范围内有效的角色则通过 <b>ClusterRole</b> 对象实现</li>
</ul></li>
</ul>

<p>
一个 Role 对象只能用于授予对某一单一命名空间中资源的访问权限
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">kind</span>: Role
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">namespace</span>: default
  <span style="color: #4eee94;">name</span>: pod-reader
<span style="color: #4eee94;">rules</span>:
- <span style="color: #4eee94;">apiGroups</span>: [<span style="color: #deb887;">""</span>] <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">&#31354;&#23383;&#31526;&#20018;"" &#34920;&#26126;&#20351;&#29992; core API group</span>
  <span style="color: #4eee94;">resources</span>: [<span style="color: #deb887;">"pods"</span>]
  <span style="color: #4eee94;">verbs</span>: [<span style="color: #deb887;">"get"</span>, <span style="color: #deb887;">"watch"</span>, <span style="color: #deb887;">"list"</span>]
</pre>
</div>

<pre class="example">
     以上示例描述了 _default_ 命名空间中的一个 Role 对象的定义，用于授予对 pod 的读访问权限
</pre>

<p>
ClusterRole 对象可以授予与 Role 对象相同的权限，但由于它们属于集群范围对象， 用它们授予对以下几种资源的访问权限：
</p>
<ul class="org-ul">
<li><p>
集群范围资源
</p>
<pre class="example">
       例如节点，即 node
</pre></li>
<li><p>
非资源类型 endpoint
</p>
<pre class="example">
       例如”/healthz”
</pre></li>
<li><p>
跨所有命名空间的命名空间范围资源
</p>
<pre class="example">
       例如 pod，需要运行命令 kubectl get pods --all-namespaces 来查询集群中所有的 pod
</pre></li>
</ul>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">kind</span>: ClusterRole
<span style="color: #4eee94;">apiVersion</span>: rbac.authorization.k8s.io/v1
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">&#37492;&#20110; ClusterRole &#26159;&#38598;&#32676;&#33539;&#22260;&#23545;&#35937;&#65292;&#25152;&#20197;&#36825;&#37324;&#19981;&#38656;&#35201;&#23450;&#20041; "namespace" &#23383;&#27573;</span>
  <span style="color: #4eee94;">name</span>: secret-reader
<span style="color: #4eee94;">rules</span>:
- <span style="color: #4eee94;">apiGroups</span>: [<span style="color: #deb887;">""</span>]
  <span style="color: #4eee94;">resources</span>: [<span style="color: #deb887;">"secrets"</span>]
  <span style="color: #4eee94;">verbs</span>: [<span style="color: #deb887;">"get"</span>, <span style="color: #deb887;">"watch"</span>, <span style="color: #deb887;">"list"</span>]
</pre>
</div>

<pre class="example">
     示例中的 ClusterRole 定义可用于授予用户对某一特定命名空间，或者所有命名空间中的 secret（取决于其 绑定 方式）的读访问权限
</pre>
</div>
</div>
<div id="outline-container-org1985e13" class="outline-3">
<h3 id="org1985e13">RoleBinding 与 ClusterRoleBinding</h3>
<div class="outline-text-3" id="text-org1985e13">
<p>
角色绑定将一个角色中定义的各种权限授予一个或者一组用户：
</p>
<ul class="org-ul">
<li>角色绑定包含了一组相关主体：
<ul class="org-ul">
<li>用户 User</li>
<li>用户组 Group</li>
<li>服务账户 Service Account</li>
<li>对被授予角色的引用</li>
</ul></li>
<li>在命名空间中可以通过 RoleBinding 对象授予权限</li>
<li>集群范围的权限授予则通过 ClusterRoleBinding 对象完成</li>
</ul>

<p>
RoleBinding 可以引用在同一命名空间内定义的 Role 对象
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">kind</span>: RoleBinding
<span style="color: #4eee94;">apiVersion</span>: rbac.authorization.k8s.io/v1
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">name</span>: read-pods
  <span style="color: #4eee94;">namespace</span>: default
<span style="color: #4eee94;">subjects</span>:
- <span style="color: #4eee94;">kind</span>: User
  <span style="color: #4eee94;">name</span>: jane
  <span style="color: #4eee94;">apiGroup</span>: rbac.authorization.k8s.io
<span style="color: #4eee94;">roleRef</span>:
  <span style="color: #4eee94;">kind</span>: Role
  <span style="color: #4eee94;">name</span>: pod-reader
  <span style="color: #4eee94;">apiGroup</span>: rbac.authorization.k8s.io
</pre>
</div>

<pre class="example">
     示例中定义的 RoleBinding 对象在 ”default” 命名空间中将 ”pod-reader” 角色授予用户”jane”

     这一授权将允许用户”jane” 从”default” 命名空间中读取 pod
</pre>

<p>
RoleBinding 对象也可以引用一个 ClusterRole 对象
</p>

<pre class="example">
     这一点允许管理员在整个集群范围内首先定义一组通用的角色，然后再在不同的命名空间中复用这些角色
</pre>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">&#20197;&#19979;&#35282;&#33394;&#32465;&#23450;&#20801;&#35768;&#29992;&#25143; "dave" &#35835;&#21462; "development" &#21629;&#21517;&#31354;&#38388;&#20013;&#30340; secret&#12290;</span>
<span style="color: #4eee94;">kind</span>: RoleBinding
<span style="color: #4eee94;">apiVersion</span>: rbac.authorization.k8s.io/v1
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">name</span>: read-secrets
  <span style="color: #4eee94;">namespace</span>: development <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">&#36825;&#37324;&#34920;&#26126;&#20165;&#25480;&#26435;&#35835;&#21462; "development" &#21629;&#21517;&#31354;&#38388;&#20013;&#30340;&#36164;&#28304;&#12290;</span>
<span style="color: #4eee94;">subjects</span>:
- <span style="color: #4eee94;">kind</span>: User
  <span style="color: #4eee94;">name</span>: dave
  <span style="color: #4eee94;">apiGroup</span>: rbac.authorization.k8s.io
<span style="color: #4eee94;">roleRef</span>:
  <span style="color: #4eee94;">kind</span>: ClusterRole
  <span style="color: #4eee94;">name</span>: secret-reader
  <span style="color: #4eee94;">apiGroup</span>: rbac.authorization.k8s.io
</pre>
</div>

<pre class="example">
     尽管示例中的 RoleBinding 引用的是一个 ClusterRole 对象，但是用户”dave”（即角色绑定主体）还是只能读取”development” 命名空间中的 secret（即 RoleBinding 所在的命名空间）
</pre>

<p>
也可以使用ClusterRoleBinding在集群级别和所有命名空间中授予权限
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">kind</span>: ClusterRoleBinding
<span style="color: #4eee94;">apiVersion</span>: rbac.authorization.k8s.io/v1
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">name</span>: read-secrets-global
<span style="color: #4eee94;">subjects</span>:
- <span style="color: #4eee94;">kind</span>: Group
  <span style="color: #4eee94;">name</span>: manager
  <span style="color: #4eee94;">apiGroup</span>: rbac.authorization.k8s.io
<span style="color: #4eee94;">roleRef</span>:
  <span style="color: #4eee94;">kind</span>: ClusterRole
  <span style="color: #4eee94;">name</span>: secret-reader
  <span style="color: #4eee94;">apiGroup</span>: rbac.authorization.k8s.io
</pre>
</div>

<pre class="example">
     示例中所定义的ClusterRoleBinding允许在用户组”manager” 中的任何用户都可以读取集群中任何命名空间中的 secret
</pre>
</div>
</div>
<div id="outline-container-org6e34f3d" class="outline-3">
<h3 id="org6e34f3d">对资源的引用</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
